LEXICON_MENU_RU: dict[str, str] = {
    '/help': 'Справка по работе бота',
    '/home': '🏠В главное меню',
}

LEXICON_INLINE_MENU_RU: dict[str, str] = {
    'about': 'Обо мне',
    'view_practises': 'Смотреть практики',
    'view_practise:': '😍🤸👉 ЗАПИСАТЬСЯ НА ONLINE-УРОК',
    'user_message': '✉ Написать сообщение ✉',
}

LEXICON_BUY_INLINE_MENU_RU: dict[str, str] = {
    'online_pay_action_direct': '🤸 Купить ONLINE-занятие в 1 клик 🤸',
    'online_abonement_pay_action_direct': '🤸 Купить ONLINE-абонемент со скидкой 🤸',
}

LEXICON_INLINE_ADMIN_MENU_RU: dict[str, str] = {
    'manage_practises': 'Управлять практиками',
    'show_online_lessons': 'Управлять online-группами',
    'manage_page:start': 'Редактировать начальный пост',
    'manage_page:about': 'Редактировать раздел "Обо мне"',
}

LEXICON_INLINE_ADMIN_PRACTISE_NAV_MENU: dict[str, str] = {
    'manage_practises': '📄 Назад с списку практик',
    'delete_practise': '✖ Удалить практику',
}

LEXICON_INLINE_ADMIN_POST_NAV_MENU: dict[str, str] = {
    'manage_page:': '📄 Назад с списку постов',
    'delete_post': '✖ Удалить пост',
}

LEXICON_INLINE_VIEW_PRACTISE_NAV_MENU: dict[str, str] = {
    'view_practises': '📄 Назад с списку практик',
}

LEXICON_INLINE_ADMIN_MEDIA_NAV_MENU: dict[str, str] = {
    'practise:': '📄 Назад к редактированию практики',
    'delete_media': '✖ Удалить урок',
}

LEXICON_INLINE_VIEW_MEDIA_NAV_MENU: dict[str, str] = {
    'view_practise:': '📄 Назад к практике',
}

LEXICON_INLINE_PRACTISE_MENU_RU: dict[str, str] = {
    'add_practise': 'Добавить новую практику',
}

LEXICON_INLINE_POST_MENU_RU: dict[str, str] = {
    'add_post': 'Добавить новый пост',
}

LEXICON_BTN_GROUP_LABELS_RU: dict[str, str] = {
    'start_menu': 'Чем я могу Вам помочь?',
    'practise_list': 'Выберите практику для редактирования/удаления',
    'practise_actions': 'Выберите желаемое действие',
    'post_actions': 'Выберите желаемое действие',
    'post_list': 'Выберите пост для редактирования/удаления',
}

LEXICON_CHAPTER_LABELS_RU: dict[str, str] = {
    'manage_practise': '👉 УПРАВЛЕНИЕ ПРАКТИКАМИ',
    'home': '👉 ГЛАВНОЕ МЕНЮ',
    'edit_practise': '👉 РЕДАКТИРОВАНИЕ ПРАКТИКИ',
    'edit_media': '👉 РЕДАКТИРОВАНИЕ УРОКА',
    'edit_post': '👉 РЕДАКТИРОВАНИЕ ПОСТА',
    'user_message': '👉 ОТПРАВКА СООБЩЕНИЙ (вы можете отправлять текст, фото и видео), я все обязательно прочитаю и напишу Вам ответ!',
    'view_practises': '👇 ДОСТУПНЫЕ ДЛЯ ПРОСМОТРА ПРАКТИКИ',
    'view_practise_selected': '🧘🧘🧘 ПРАКТИКА 🧘🧘🧘',
    'view_lesson_selected': '🧘 ЗАНЯТИЕ 🧘',
    'edit_online_media': '🧘 ONLINE ЗАНЯТИЕ 🧘',
    'manage_page': 'УПРАВЛЯТЬ СТРАНИЦЕЙ',
}

LEXICON_CHAPTER_EXIT_RU: dict[str, str] = {
    'practise_exit': '🏠 Закончить и выйти в главное меню',
    'post_exit': '🏠 Закончить и выйти в главное меню',
    'about_exit': '🏠 Выйти в главное меню',
    'group_exit': '🏠 Выйти в главное меню',
}

LEXICON_ADMIN_ONLINE_MENU_RU: dict[str, str] = {
    'send_group_message': 'НАПИСАТЬ ВСЕМ УЧАСТНИКАМ СООБЩЕНИЕ',
}

LEXICON_ADMIN_ONLINE_MENU_DEEP_RU: dict[str, str] = {
    'show_online_lessons': 'НАЗАД К СПИСКУ ONLINE-ЗАНЯТИЙ',
}

LEXICON_PRACTISE_CATEGORY: dict[int, str] = {
    1: 'lesson',
    2: 'online',
}

LEXICON_DEFAULT_NAMES_RU: dict[str, str] = {
    'available_online': '🧘 ДОСТУПНО ONLINE-ЗАНЯТИЙ: ',
    'group_menu_label': 'Что вы хотите сделать дальше?',
    'admin_lessons_list': 'Список доступных уроков:',
    'checkout': 'ОТМЕНИТЬ ЗАПИСЬ',
    'already_in_group': '☯☯☯ Вы уже записаны на данное ONLINE-занятие!',
    'send': 'Отправить',
    'comm_online_lesson': '🧘 Это online-занятие платное! 🧘',
    'free_online_lesson': '🧘 Это online-занятие бесплатное! 🧘',
    'join_online_lesson': 'ЗАПИСАТЬСЯ',
    'online_join_menu': '🧘 Меню ONLINE урока 🧘',
    'spam_stream_link': '✉ Отправить ссылку всем участникам ✉',
    'media_action_date': 'Назначьте дату урока',
    'practise_category': 'Категория практики',
    'payment_success': 'Платеж успешно завершен!',
    'payment_error': 'Что-то пошло с оплатой не так, попробуйте позже...',
    'practise_title': 'Новая практика...',
    'media_title': 'Новый урок...',
    'post_name': 'Новый пост...',
    'practise_description': 'Измените описание практики...',
    'media_description': 'Измените описание урока...',
    'title': 'Заголовок',
    'name': 'Имя',
    'change': 'Изменить',
    'description': 'Описание',
    'about_practise': 'Описание для сайта',
    'order': 'Порядок следования',
    'media_content': 'Медиа-контент',
    'media_content_empty': 'Сюда пока ничего не загружено',
    'stream_link': 'Ссылка на стрим',
    'group_prompt_message': 'Отправьте сообщение всем участникам группы 👇',
    'post_change_name': 'Укажите новое имя поста 👇',
    'post_change_order': 'Укажите порядок поста 👇',
    'post_change_post': 'Напишите пост (или загрузите фото, видео, группу медиа-объектов) 👇',
    'practise_change_title': 'Укажите новый заголовок для практики 👇',
    'practise_change_description': 'Укажите новое описание для практики 👇',
    'practise_change_about': 'Укажите новое описание для сайта 👇',
    'practise_change_content': 'Укажите новое содержание для практики 👇',
    'practise_change_media': 'Загрузите медиа-контент (фото или видео-файл) 👇',
    'media_change_action_date': 'Назначьте дату online-урока в формате dd.mm.YYYY hh:mm 👇',
    'media_change_title': 'Укажите новый заголовок для урока 👇',
    'media_change_category': 'Укажите категорию подготовки для ученика 👇',
    'practise_change_category': 'Укажите категорию практики 👇',
    'media_change_description': 'Укажите новое описание для урока 👇',
    'media_change_media': 'Загрузите медиа-контент (фото или видео-файл)',
    'media_change_cost': 'Укажите стоимость урока (в рублях, без дробной части)',
    'media_change_stream_link': 'Укажите ссылку на стрим 👇',
    'practise_navigation_menu': '\n ☸☸☸ Навигационное меню ☸☸☸',
    'delete_success': 'Успешно удалено!',
    'practise_content_published': 'Практика опубликована!',
    'practise_content_not_published': 'Практика еще не опубликована',
    'media_content_free': 'Урок бесплатный',
    'media_content_not_free': 'Урок платный',
    'add_media': '✚ Добавить урок',
    'lessons': '\n   Доступные уроки\n',
    'media_cost': '$ Стоимость урока',
    'media_category': 'Категория ученика',
    'success_swap': 'Порядок успешно изменен!',
    'choose_practise': 'Выберите практику:',
    'invite_payment': '''\nКонтент данного урока платный.\nВы можете оплатить урок прямо в Telegram, это абсолютно безопасно.''',
    'payment_cost': 'Стоимость урока: ',
    'pay': 'Начать процесс оплаты',
    'payment_description': 'Оплата за получение услуги на сервисе @YogaMasterMindBot',
    'lesson_online_payment_menu': 'Для участия в online занятии Вы можете:'
}

LEXICON_ONLINE_PAYMENT_GROUP_RU: dict[str, str] = {
    'lesson_online_pay_action': 'Оплатить ОДНО занятие',
    'lesson_online_abonement_pay_action': 'АБОНЕМЕНТ (10 занятий - 10% скидка)',
}

LEXICON_BTN_LABELS_RU: dict[str, str] = {
    'cancel_edit': '✖ Отменить редактирование',
}

LEXICON_MEDIA_CATEGORIES_RU: dict[str, str] = {
    'any': "Любой",
    'novice': "Новичек",
    'middle': "Средний",
    'advanced': "Продвинутый",
}


LEXICON_BASIC_BTNS_RU: dict[str, str] = {
    'back': "◀️Назад",
}

LEXICON_DEFAULT_MESSGES_RU: dict[str, str] = {
    'message_sent': "✉ Сообщение успешно отправлено",
}
