LEXICON_MENU_RU: dict[str, str] = {
    '/help': 'Справка по работе бота',
    '/home': '🏠В главное меню',
}

LEXICON_INLINE_MENU_RU: dict[str, str] = {
    'about': 'Обо мне',
    'download': 'Скачать уроки',
    'commercial': 'Платный контент',
    'message': 'Написать сообщение',
    'video': 'Отправить видео',
}

LEXICON_INLINE_ADMIN_MENU_RU: dict[str, str] = {
    'manage_practises': 'Управлять практиками',
    'manage_medias': 'Управлять медиа-контентом',
}

LEXICON_INLINE_PRACTISE_MENU_RU: dict[str, str] = {
    'add_practise': 'Добавить новую практику',
}

LEXICON_BTN_GROUP_LABELS_RU: dict[str, str] = {
    'start_menu': 'Чем я могу Вам помочь?',
    'practise_list': 'Выберите практику для редактирования/удаления',
    'practise_actions': 'Выберите желаемое действие',
}

LEXICON_CHAPTER_LABELS_RU: dict[str, str] = {
    'manage_practise': '👉 УПРАВЛЕНИЕ ПРАКТИКАМИ',
    'home': '👉 ГЛАВНОЕ МЕНЮ',
    'edit_practise': '👉 РЕДАКТИРОВАНИЕ ПРАКТИКИ',
}

LEXICON_CHAPTER_EXIT_RU: dict[str, str] = {
    'practise_exit': '🏠 Закончить и выйти в главное меню',
}

LEXICON_DEFAULT_NAMES_RU: dict[str, str] = {
    'practise_title': 'Новая практика...',
    'practise_description': 'Измените описание практики...',
    'title': 'Заголовок',
    'change': 'Изменить',
    'description': 'Описание',
    'media_content': 'Медиа-контент',
    'media_content_empty': 'Сюда пока ничего не загружено',
    'practise_change_title': 'Укажите новый заголовок для практики 👇',
    'practise_change_description': 'Укажите новое описание для практики 👇',
    'practise_change_media': 'Загрузите медиа-контент (фото или видео-файл)',
    'practise_navigation_menu': '--- Навигационное меню ---',
    'back_practise_list': '📄 Назад с списку практик',
    'delete_practise': '✖ Удалить практику',
    'delete_success': 'Успешно удалено!',
}

LEXICON_BTN_LABELS_RU: dict[str, str] = {
    'cancel_edit': '✖ Отменить редактирование',
}
